In [2]:
%load_ext sql

In [3]:
%sql sqlite://///Users/laurasg/Documents/Ironhack_data/20-lab-sql-select/publications.db

In [4]:
%config SqlMagic.style = 'ALL'

# Challenge 1

In [59]:
%%sql
SELECT au.au_id AS 'AUTHOR ID', au.au_lname AS 'LAST NAME', au.au_fname AS 'FIRST NAME', tls.title AS 'TITLE', pubs.pub_name AS 'PUBLISHER' 
FROM authors au
JOIN 
    titleauthor ta ON au.au_id=ta.au_id
JOIN
    titles tls ON ta.title_id = tls.title_id  
JOIN
    publishers pubs ON tls.pub_id = pubs.pub_id
JOIN
    publishers AS totalpubs ON tls.pub_id = totalpubs.pub_id
GROUP BY
    totalpubs

 * sqlite://///Users/laurasg/Documents/Ironhack_data/20-lab-sql-select/publications.db
(sqlite3.OperationalError) no such column: totalpubs
[SQL: SELECT au.au_id AS 'AUTHOR ID', au.au_lname AS 'LAST NAME', au.au_fname AS 'FIRST NAME', tls.title AS 'TITLE', pubs.pub_name AS 'PUBLISHER'
FROM authors au
JOIN
    titleauthor ta ON au.au_id=ta.au_id
JOIN
    titles tls ON ta.title_id = tls.title_id
JOIN
    publishers pubs ON tls.pub_id = pubs.pub_id
JOIN
    publishers AS totalpubs ON tls.pub_id = totalpubs.pub_id
GROUP BY
    totalpubs]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [32]:
%%sql
SELECT count (*)
FROM authors au
JOIN 
    titleauthor ta ON au.au_id=ta.au_id
JOIN
    titles tls ON ta.title_id = tls.title_id  
JOIN
    publishers pubs ON tls.pub_id = pubs.pub_id

 * sqlite://///Users/laurasg/Documents/Ironhack_data/20-lab-sql-select/publications.db
Done.

[(25,)]

In [33]:
%%sql
SELECT count(*)
FROM titleauthor

 * sqlite://///Users/laurasg/Documents/Ironhack_data/20-lab-sql-select/publications.db
Done.

[(25,)]

# Challenge 2

In [43]:
%%sql
SELECT pubs.pub_name, titles.title_id, COUNT (*) AS 'TITLE COUNT'
FROM publishers pubs
JOIN titles titles
ON pubs.pub_id = titles.pub_id
GROUP BY 'AUTHOR ID'

 * sqlite://///Users/laurasg/Documents/Ironhack_data/20-lab-sql-select/publications.db
Done.

[('Algodata Infosystems', 'BU1032', 6),
 ('Binnet & Hardley', 'MC2222', 7),
 ('New Moon Books', 'BU2075', 5)]

In [82]:
%%sql
SELECT au.au_id AS 'AUTHOR ID', au.au_lname AS 'LAST NAME', au.au_fname AS 'FIRST NAME', pubs.pub_name AS 'PUBLISHER', COUNT(*) AS 'TITLE COUNT' 
FROM authors au
JOIN 
    titleauthor ta ON au.au_id=ta.au_id
JOIN
    titles tls ON ta.title_id = tls.title_id  
JOIN
    publishers pubs ON tls.pub_id = pubs.pub_id

GROUP BY tls.title

 * sqlite://///Users/laurasg/Documents/Ironhack_data/20-lab-sql-select/publications.db
Done.

[('238-95-7766', 'Carson', 'Cheryl', 'Algodata Infosystems', 1),
 ('724-80-9391', 'MacFeather', 'Stearns', 'Binnet & Hardley', 2),
 ('267-41-2394', "O'Leary", 'Michael', 'Algodata Infosystems', 2),
 ('486-29-1786', 'Locksley', 'Charlene', 'New Moon Books', 1),
 ('648-92-1872', 'Blotchet-Halls', 'Reginald', 'Binnet & Hardley', 1),
 ('899-46-2035', 'Ringer', 'Anne', 'New Moon Books', 2),
 ('998-72-3567', 'Ringer', 'Albert', 'New Moon Books', 1),
 ('486-29-1786', 'Locksley', 'Charlene', 'Algodata Infosystems', 1),
 ('807-91-6654', 'Panteley', 'Sylvia', 'Binnet & Hardley', 1),
 ('172-32-1176', 'White', 'Johnson', 'New Moon Books', 1),
 ('427-17-2319', 'Dull', 'Ann', 'Algodata Infosystems', 2),
 ('712-45-1867', 'del Castillo', 'Innes', 'Binnet & Hardley', 1),
 ('274-80-9391', 'Straight', 'Dean', 'Algodata Infosystems', 1),
 ('267-41-2394', "O'Leary", 'Michael', 'Binnet & Hardley', 3),
 ('213-46-8915', 'Green', 'Marjorie', 'Algodata Infosystems', 2),
 ('722-51-5454', 'DeFrance', 'Michel', 'Binnet & Hardley', 2),
 ('213-46-8915', 'Green', 'Marjorie', 'New Moon Books', 1)]

## Challenge 3

In [88]:
%%sql
SELECT au.au_id AS 'AUTHOR ID', au.au_lname AS 'LAST NAME', au.au_fname AS 'FIRST NAME', SUM(sls.qty) AS 'TOTAL' 
FROM authors au
JOIN 
    titleauthor ta ON au.au_id=ta.au_id
JOIN
    titles tls ON ta.title_id = tls.title_id  
JOIN
    sales sls ON tls.title_id = sls.title_id
    
    
GROUP BY au.au_id
ORDER BY TOTAL desc
Limit 3

 * sqlite://///Users/laurasg/Documents/Ironhack_data/20-lab-sql-select/publications.db
Done.

[('899-46-2035', 'Ringer', 'Anne', 148),
 ('998-72-3567', 'Ringer', 'Albert', 133),
 ('213-46-8915', 'Green', 'Marjorie', 50)]

## Challenge 4

In [92]:
%%sql
SELECT au.au_id AS 'AUTHOR ID', au.au_lname AS 'LAST NAME', au.au_fname AS 'FIRST NAME', SUM(sls.qty) AS 'TOTAL' 
FROM authors au
JOIN 
    titleauthor ta ON au.au_id=ta.au_id
JOIN
    titles tls ON ta.title_id = tls.title_id  
JOIN
    sales sls ON tls.title_id = sls.title_id
    
    
GROUP BY au.au_id
ORDER BY TOTAL desc
Limit 3

 * sqlite://///Users/laurasg/Documents/Ironhack_data/20-lab-sql-select/publications.db
Done.

[('899-46-2035', 'Ringer', 'Anne', 148),
 ('998-72-3567', 'Ringer', 'Albert', 133),
 ('213-46-8915', 'Green', 'Marjorie', 50)]

In [98]:
%%sql
SELECT au.au_id AS 'AUTHOR ID', au.au_lname AS 'LAST NAME', au.au_fname AS 'FIRST NAME', IFNULL(SUM(sls.qty), 0) AS 'TOTAL'
FROM authors au
LEFT JOIN 
    titleauthor ta ON au.au_id=ta.au_id
LEFT JOIN
    titles tls ON ta.title_id = tls.title_id  
LEFT JOIN
    sales sls ON tls.title_id = sls.title_id
    
    
GROUP BY au.au_id
ORDER BY TOTAL desc

 * sqlite://///Users/laurasg/Documents/Ironhack_data/20-lab-sql-select/publications.db
Done.

[('899-46-2035', 'Ringer', 'Anne', 148),
 ('998-72-3567', 'Ringer', 'Albert', 133),
 ('213-46-8915', 'Green', 'Marjorie', 50),
 ('427-17-2319', 'Dull', 'Ann', 50),
 ('846-92-7186', 'Hunter', 'Sheryl', 50),
 ('267-41-2394', "O'Leary", 'Michael', 45),
 ('724-80-9391', 'MacFeather', 'Stearns', 45),
 ('722-51-5454', 'DeFrance', 'Michel', 40),
 ('807-91-6654', 'Panteley', 'Sylvia', 40),
 ('238-95-7766', 'Carson', 'Cheryl', 30),
 ('486-29-1786', 'Locksley', 'Charlene', 25),
 ('472-27-2349', 'Gringlesby', 'Burt', 20),
 ('648-92-1872', 'Blotchet-Halls', 'Reginald', 20),
 ('672-71-3249', 'Yokomoto', 'Akiko', 20),
 ('756-30-7391', 'Karsen', 'Livia', 20),
 ('172-32-1176', 'White', 'Johnson', 15),
 ('274-80-9391', 'Straight', 'Dean', 15),
 ('409-56-7008', 'Bennet', 'Abraham', 15),
 ('712-45-1867', 'del Castillo', 'Innes', 10),
 ('341-22-1782', 'Smith', 'Meander', 0),
 ('527-72-3246', 'Greene', 'Morningstar', 0),
 ('724-08-9931', 'Stringer', 'Dirk', 0),
 ('893-72-1158', 'McBadden', 'Heather', 0)]